String.class_eval do
  def convert_vi_to_en
    str = self
    str = str.tr('/(à|á|ạ|ả|ã|â|ầ|ấ|ậ|ẩ|ẫ|ă|ằ|ắ|ặ|ẳ|ẵ)/', 'a')
    str = str.tr('/(è|é|ẹ|ẻ|ẽ|ê|ề|ế|ệ|ể|ễ)/', 'e')
    str = str.tr('/(ì|í|ị|ỉ|ĩ)/', 'i')
    str = str.tr('/(ò|ó|ọ|ỏ|õ|ô|ồ|ố|ộ|ổ|ỗ|ơ|ờ|ớ|ợ|ở|ỡ)/', 'o')
    str = str.tr('/(ù|ú|ụ|ủ|ũ|ư|ừ|ứ|ự|ử|ữ)/', 'u')
    str = str.tr('/(ỳ|ý|ỵ|ỷ|ỹ)/', 'y')
    str = str.tr('/(đ)/', 'd')
    str = str.tr('/(À|Á|Ạ|Ả|Ã|Â|Ầ|Ấ|Ậ|Ẩ|Ẫ|Ă|Ằ|Ắ|Ặ|Ẳ|Ẵ)/', 'A')
    str = str.tr('/(È|É|Ẹ|Ẻ|Ẽ|Ê|Ề|Ế|Ệ|Ể|Ễ)/', 'E')
    str = str.tr('/(Ì|Í|Ị|Ỉ|Ĩ)/', 'I')
    str = str.tr('/(Ò|Ó|Ọ|Ỏ|Õ|Ô|Ồ|Ố|Ộ|Ổ|Ỗ|Ơ|Ờ|Ớ|Ợ|Ở|Ỡ)/', 'O')
    str = str.tr('/(Ù|Ú|Ụ|Ủ|Ũ|Ư|Ừ|Ứ|Ự|Ử|Ữ)/', 'U')
    str = str.tr('/(Ỳ|Ý|Ỵ|Ỷ|Ỹ)/', 'Y')
    str = str.tr('/(Đ)/', 'D')
    str
  end
end